
===========================================================================
report_tns
============================================================================
tns -5.64

===========================================================================
report_wns
============================================================================
wns -0.71

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.71

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.10
