
===========================================================================
report_tns
============================================================================
tns -2597.88

===========================================================================
report_wns
============================================================================
wns -3.07

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.07

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.76
