
===========================================================================
report_tns
============================================================================
tns -1.75

===========================================================================
report_wns
============================================================================
wns -0.33

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.33

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.10
