
===========================================================================
report_tns
============================================================================
tns -491.19

===========================================================================
report_wns
============================================================================
wns -1.61

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.61

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.14
