###############################################################################
# Created by write_sdc
# Mon Nov 10 00:33:25 2025
###############################################################################
current_design simproc_system
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_per_bit[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {uart_rx}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr_byte[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cmd_byte[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_byte[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {halt}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_reg[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {uart_tx}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {halt}]
set_load -pin_load 0.0334 [get_ports {uart_tx}]
set_load -pin_load 0.0334 [get_ports {addr_byte[7]}]
set_load -pin_load 0.0334 [get_ports {addr_byte[6]}]
set_load -pin_load 0.0334 [get_ports {addr_byte[5]}]
set_load -pin_load 0.0334 [get_ports {addr_byte[4]}]
set_load -pin_load 0.0334 [get_ports {addr_byte[3]}]
set_load -pin_load 0.0334 [get_ports {addr_byte[2]}]
set_load -pin_load 0.0334 [get_ports {addr_byte[1]}]
set_load -pin_load 0.0334 [get_ports {addr_byte[0]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[7]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[6]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[5]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[4]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[3]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[2]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[1]}]
set_load -pin_load 0.0334 [get_ports {cmd_byte[0]}]
set_load -pin_load 0.0334 [get_ports {data_byte[7]}]
set_load -pin_load 0.0334 [get_ports {data_byte[6]}]
set_load -pin_load 0.0334 [get_ports {data_byte[5]}]
set_load -pin_load 0.0334 [get_ports {data_byte[4]}]
set_load -pin_load 0.0334 [get_ports {data_byte[3]}]
set_load -pin_load 0.0334 [get_ports {data_byte[2]}]
set_load -pin_load 0.0334 [get_ports {data_byte[1]}]
set_load -pin_load 0.0334 [get_ports {data_byte[0]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[7]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[6]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[5]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[4]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[3]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[2]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[1]}]
set_load -pin_load 0.0334 [get_ports {tx_reg[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {uart_rx}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_per_bit[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
